 #########################################################
 ##                   Minisys-1 测试程序2，测试接口                                          #
 ##			  硬件平台：Nexys 4 			                                                        # 
 ##			  该程序用于仿真测试                                                                   #
 ##                                2016.12                                                                    #
 #########################################################
 ##本程序中约定，$28中放端口地址的高20位                                         #
 #########################################################

.data  0000                      		#数据段定义开始
						#数据定义的首地址
	NUM1  	.word  0x00000055            		  
	NUM2  	.word  0x000000AA       			
	NUM2  	.word  0x000000AA       			
	NUM3  	.word  0x00000000      			
.text  0000			      		#代码段定义开始
	   					#代码开始的首地址
start:lui   $1,0xFFF				#让$28为0xFFFF0000作为端口地址的高16位
	ori   $28,$1,0xF000             #$28端口是系统的I/O地址的高20位
    	ori   $1,$0,0xFF0F
	sw   $1, 0xC04($28)				#数码管控制寄存器，8位数码管全亮，小数点只显示低4个
	lw   $2,NUM1($0)
	lw   $3,NUM2($0)
	add $1,$2,$3
	sw   $1, 0xC00($28)				#显示数码管低四位
	srl  $1,$1,16
    sw  $1,0xC02($28)    			# 显示数码管高四位
	sw   $2, 0xC50($28)				# 喂看门狗
	addi $2,$0,0x0A
	sw $2,0xC30($28)					# PWM最大值			
	addi $2,$0,1
	sw $2,0xC32$28)					# PWM中间值
	addi $2,$0,1
	sw $2,0xC34$28)					# 使能PWM
k1:	addi $2,$0,2
	sw $2,0xC20($28)					# 定时器0设置为重复定时
	addi $2,$0,7
	sw $2,0xC24($28)					# 初始值为7
	sw   $2, 0xC50($28)				    # 喂看门狗
	nop
	nop
#	lw $6,0xC24($28)				#读当前计数值
#    sw  $6,0xC02($28) 				    # 显示数码管高四位
delay:or  $2,$zero,$zero
	lw  $2, 0xC12($28)					#读键盘状态
	ori  $1, $zero,1
	sw   $2, 0xC50($28)				#喂看门狗
	bne $2,$1, delay					#没有键
	or  $2,$zero,$zero
	lw  $2, 0xC10($28)					#读键
	sw  $2, 0xC00($28)					#显示数码管低四位
	nop
	nop
	nop
	nop
	j k1
.text 0xFFF8	
	jr  $26
.text 0xFFFC	
	jr  $27
